Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.

student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
student_data.head(10)

In [1]:
import pandas as pd

In [2]:
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
student_data.head(10)

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

Now we proceed to group by "school_code" using aggregate data ( mean() for numeric values ).

In [10]:
groupsdata= student_data.groupby(by="school_code")["age"].mean().reset_index().rename(columns={"age":"avg_age"})
groupsdata

  school_code  avg_age
0        s001     12.5
1        s002     13.0
2        s003     13.0
3        s004     12.0

In [11]:
type(groupsdata)

pandas.core.frame.DataFrame

In [7]:
groupsdata1 = student_data.groupby('school_code')['height'].mean().to_frame().rename(columns={"height" : "avg_height"})
groupsdata1

             avg_height
school_code
s001              170.0
s002              171.5
s003              186.0
s004              159.0

In [12]:
type(groupsdata1)

pandas.core.frame.DataFrame

In [8]:
groupsdata2 = student_data.groupby('school_code')['weight'].mean().to_frame().rename(columns={"weight":"avg_weight"})
groupsdata2

             avg_weight
school_code
s001               32.5
s002               31.5
s003               33.0
s004               32.0

In [13]:
type(groupsdata2)

pandas.core.frame.DataFrame

We create a new dataframe called "numeric_df" with all the numeric datas calculated in the steps above.

In [15]:
numeric_df=student_data.groupby(by="school_code")[["age","height","weight"]].mean().reset_index()
numeric_df=numeric_df.rename(columns={"age":"avg_age","height":"avg_height","weight":"avg_weight"})
numeric_df

  school_code  avg_age  avg_height  avg_weight
0        s001     12.5       170.0        32.5
1        s002     13.0       171.5        31.5
2        s003     13.0       186.0        33.0
3        s004     12.0       159.0        32.0

In [16]:
type(numeric_df)

pandas.core.frame.DataFrame